[
    {
        "pimage":"./Staking.png",
        "ptitle": "Staking Dapp",
        "pdesc": "Staking Dapp is a decentralized application that allows users to stake their cryptocurrency assets and earn rewards. Built on the Ethereum blockchain using Solidity smart contracts, the Dapp ensures secure and transparent transactions. Users can stake various tokens, track their rewards, and withdraw their earnings with ease. Staking Dapp offers a user-friendly interface and seamless integration with popular wallets like MetaMask, making it accessible to a wide range of users.",
        "plink": "https://github.com/Anmolgaur7/Staking-App"
        
    },
    {
        "pimage":"./crpto.png",
        "ptitle": "Crypto Wallet (Sepolia)",
        "pdesc": "Sepolia is a secure and user-friendly cryptocurrency wallet that enables users to store, send, and receive digital assets. Built on the Ethereum blockchain, Sepolia leverages smart contracts to ensure the integrity and security of transactions. Users can manage multiple cryptocurrencies, view their transaction history, and monitor their portfolio in real-time. Sepolia offers a seamless and intuitive interface, making it easy for both beginners and experienced users to interact with the blockchain.",
        "plink": "https://github.com/Anmolgaur7/CryptoWallet-"
        
    },
    {
        "pimage":"./otakuoasis.jpg",
        "ptitle": "OtakuOasis",
        "pdesc": "Your go-to MERN stack-powered anime merchandise hub! With MongoDB housing our extensive catalog, Express.js for seamless navigation, React.js for dynamic interfaces, and Node.js ensuring speedy transactions, it's a smooth, secure, and personalized shopping experience. Engage with the community on our React-powered forum, and let Node.js handle authentication for a safe space. Dive into OtakuOasis for all your anime merch needs!",
        "plink": "https://github.com/Anmolgaur7/otakuoasis"
        
    },
    {
        "pimage":"./whisper.png",
        "ptitle": "Whisper",
        "pdesc": "Whisper stands out as a chat website built on React for dynamic UI, MongoDB for efficient data storage, and Socket.io for real-time communication. Security is a priority, employing bcrypt.js to hash passwords, fortifying user authentication. These measures create a platform where users can engage in conversations with confidence, knowing their data is kept private and secure.",
        "plink": "https://github.com/Anmolgaur7/whisper"
        
    },
    {
        "pimage":"./halaimg.png",
        "ptitle": "Halanote",
        "pdesc": "Halanote is a full-stack web application developed using the MERN (MongoDB, Express.js, React, Node.js) stack. It offers a robust note-taking system with advanced features, including user authentication, voice input functionality, and secure data handling through JSON Web Tokens (JWT). Halanote provides a secure user authentication system. Users can register, log in, and log out with their unique credentials. Passwords are hashed and stored securely to protect user dataJSON Web Tokens (JWT) are used for secure authorization. This technique ensures that only authenticated users can access their notes and data, enhancing the privacy and security of the platform.One of the unique features of Halanote is its voice input functionality. Users can dictate their notes, making it a convenient option for those who prefer spoken communication or have accessibility needs.",
        "plink": "https://github.com/Anmolgaur7/halanote"
    },
    {
        "pimage":"./tenkiimg.png",
        "ptitle": "Tenkiknow",
        "pdesc": "Tenkiknow is a modern weather application designed to provide users with real-time weather information from around the world. Developed using the MERN (MongoDB, Express.js, React, Node.js) stack for the front end and powered by Tailwind CSS, Tenkiknow offers an interactive and visually engaging user interface. Notably, it does not rely on a database but fetches weather data directly from a weather API.Tenkiknow retrieves current weather conditions, forecasts, and additional meteorological details for user-specified locations. It ensures that users have access to the latest weather information at their fingertips.Tenkiknow includes a location search feature that enables users to find weather information for specific cities, zip codes, or geographic coordinates. This feature simplifies the process of obtaining weather updates for desired locations.",
        "plink": "https://tenkiknow.vercel.app/"
    },
    {
        "pimage":"./bookmania.png",
        "ptitle": "Bookmania",
        "pdesc": "Bookmania is an innovative bookstore website built on React and Firebase. Serving as a centralized platform, it facilitates seamless interaction between diverse users. Leveraging React ensures an engaging and dynamic user interface, while Firebase handles real-time data synchronization, enabling users to browse, buy, and share their favorite books effortlessly. Bookmania transforms the traditional bookstore experience, fostering a community of readers within a modern, digital environment.",
        "plink": " https://bookmania.vercel.app/"
    }

]